In [1]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

df = pd.read_csv('red_30_tech_us_sales.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4976 entries, 0 to 4975
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EmpID          4976 non-null   int64
 1   OrderNum       4976 non-null   int64
 2   OrderDate      4976 non-null   object
 3   OrderType      4976 non-null   object
 4   Quantity       4976 non-null   int64
 5    Price         4976 non-null   object
 6    Discount      4976 non-null   object
 7    Order Total   4976 non-null   object
dtypes: int64(3), object(5)
memory usage: 311.1+ KB

In [4]:
df.columns = df.columns.str.strip()
df.head()

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,Order Total
0,900015476,1100948,9/3/2017,Retail,1,$44.95,0,$44.95
1,900015476,1101096,9/24/2017,Wholesale,10,$4.99,$1.00,$48.90
2,900015476,1101138,10/1/2017,Wholesale,4,$250.00,$50.00,$950.00
3,900015476,1101158,10/3/2017,Retail,1,$250.00,0,$250.00
4,900015476,1101181,10/9/2017,Retail,1,$13.99,0,$13.99

In [5]:
df['Order Total'] = df['Order Total'].astype(str).str.replace(r'[\s"$#,]', '', regex = True).astype(float)
df['Discount'] = df['Discount'].astype(str).str.replace(r'[\s"$#,]', '', regex = True).astype(float)
df['Price'] = df['Price'].astype(str).str.replace(r'[\s"$#,]', '', regex = True).astype(float)

In [6]:
df.head()

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,Order Total
0,900015476,1100948,9/3/2017,Retail,1,44.95,0.0,44.95
1,900015476,1101096,9/24/2017,Wholesale,10,4.99,1.0,48.90
2,900015476,1101138,10/1/2017,Wholesale,4,250.00,50.0,950.00
3,900015476,1101158,10/3/2017,Retail,1,250.00,0.0,250.00
4,900015476,1101181,10/9/2017,Retail,1,13.99,0.0,13.99

In [7]:
df['OrderDate'] = pd.to_datetime(df['OrderDate'],
                  format = '%m/%d/%Y',
                  errors = 'coerce'
)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4976 entries, 0 to 4975
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmpID        4976 non-null   int64
 1   OrderNum     4976 non-null   int64
 2   OrderDate    4976 non-null   datetime64[ns]
 3   OrderType    4976 non-null   object
 4   Quantity     4976 non-null   int64
 5   Price        4976 non-null   float64
 6   Discount     4976 non-null   float64
 7   Order Total  4976 non-null   float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(1)
memory usage: 311.1+ KB

In [9]:
df.head()

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,Order Total
0,900015476,1100948,2017-09-03,Retail,1,44.95,0.0,44.95
1,900015476,1101096,2017-09-24,Wholesale,10,4.99,1.0,48.90
2,900015476,1101138,2017-10-01,Wholesale,4,250.00,50.0,950.00
3,900015476,1101158,2017-10-03,Retail,1,250.00,0.0,250.00
4,900015476,1101181,2017-10-09,Retail,1,13.99,0.0,13.99

In [12]:
df.isnull().sum()

EmpID          0
OrderNum       0
OrderDate      0
OrderType      0
Quantity       0
Price          0
Discount       0
Order Total    0
dtype: int64

In [13]:
df[df['EmpID'].isnull()]

Empty DataFrame
Columns: [EmpID, OrderNum, OrderDate, OrderType, Quantity, Price, Discount, Order Total]
Index: []

In [15]:
df[df['OrderDate'].isnull()]

Empty DataFrame
Columns: [EmpID, OrderNum, OrderDate, OrderType, Quantity, Price, Discount, Order Total]
Index: []

In [16]:
df[df['OrderType'].isnull()]

Empty DataFrame
Columns: [EmpID, OrderNum, OrderDate, OrderType, Quantity, Price, Discount, Order Total]
Index: []

In [17]:
df[df['Quantity'].isnull()]

Empty DataFrame
Columns: [EmpID, OrderNum, OrderDate, OrderType, Quantity, Price, Discount, Order Total]
Index: []

In [20]:
# setting a flag
df['OrderDate_null'] = df['OrderDate'].isnull()
df.head()

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,Order Total,OrderDate_null
0,900015476,1100948,2017-09-03,Retail,1,44.95,0.0,44.95,False
1,900015476,1101096,2017-09-24,Wholesale,10,4.99,1.0,48.90,False
2,900015476,1101138,2017-10-01,Wholesale,4,250.00,50.0,950.00,False
3,900015476,1101158,2017-10-03,Retail,1,250.00,0.0,250.00,False
4,900015476,1101181,2017-10-09,Retail,1,13.99,0.0,13.99,False

In [21]:
conditon = df['Quantity'].isnull() & (df['OrderDate_null'] == False)
df.loc[conditon, 'Quantity'] = (df['Order Total'] + df['Discount']) / df['Price']

In [26]:
print(df.loc[527])

EmpID                       900010405
OrderNum                      1105118
OrderDate         2019-05-03 00:00:00
OrderType                   Wholesale
Quantity                           10
Price                           599.0
Discount                        119.8
Order Total                    5870.2
OrderDate_null                  False
Name: 527, dtype: object

In [28]:
# check duplicated row 
df[df.duplicated()] # it shows all the duplicated rows

Empty DataFrame
Columns: [EmpID, OrderNum, OrderDate, OrderType, Quantity, Price, Discount, Order Total, OrderDate_null]
Index: []

In [29]:
df[df['OrderNum'] == 1101902]

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,Order Total,OrderDate_null
12,900015476,1101902,2018-01-19,Wholesale,5,7.99,1.6,38.35,False

In [30]:
df[df['OrderNum'] == 1105038]

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,Order Total,OrderDate_null
357,900018190,1105038,2019-04-20,Retail,1,19.99,0.0,19.99,False

In [31]:
df_no_dupes = df.drop_duplicates()

In [33]:
df_no_dupes[df_no_dupes['OrderNum'] == 1101902] # after droping dulicates check

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,Order Total,OrderDate_null
12,900015476,1101902,2018-01-19,Wholesale,5,7.99,1.6,38.35,False

In [35]:
# now, create a new csv file with a new name from cleaned dataframe
df_no_dupes.to_csv('red_30_sales_cleaned.csv', index = False)